# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name SlowRC -cap_table {/tools/kits/tower/PDK_TS18SL/iit/TSL_0.18_6M1L.CapTbl} -T {125} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1} -postRoute_cap {1} -postRoute_xcap {1} -postRoute_clkres {0} -postRoute_clkcap {0} -qx_tech_file {/tools/kits/tower/PDK_TS18SL/iit/qrcTechFile}
create_rc_corner -name FastRC -cap_table {/tools/kits/tower/PDK_TS18SL/iit/TSL_0.18_6M1L.CapTbl} -T {-40} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1} -postRoute_cap {1} -postRoute_xcap {1} -postRoute_clkres {0} -postRoute_clkcap {0} -qx_tech_file {/tools/kits/tower/PDK_TS18SL/iit/qrcTechFile}
create_library_set -name Typ -timing {/tools/kits/tower/PDK_TS18SL/CIO150_1_8v_Super_Compact_Inline_I_O_2007_07/synopsys/2002.05/models/tsl18cio150_typ.lib /tools/kits/tower/PDK_TS18SL/FS120_STD_Cells_0_18um_2005_12/DW_TOWER_tsl18fs120/2005.12/synopsys/2004.12/models/tsl18fs120_typ.lib /users/iit/tower_memories/spram2048x72_cb/spram2048x72_cb/tsl18_memory_typ.lib /users/iit/tower_memories/dpram256x18_cb/dpram256x18_cb_typ.lib}
create_library_set -name Min -timing {/tools/kits/tower/PDK_TS18SL/CIO150_1_8v_Super_Compact_Inline_I_O_2007_07/synopsys/2002.05/models/tsl18cio150_min.lib /tools/kits/tower/PDK_TS18SL/FS120_STD_Cells_0_18um_2005_12/DW_TOWER_tsl18fs120/2005.12/synopsys/2004.12/models/tsl18fs120_min.lib /users/iit/tower_memories/spram2048x72_cb/spram2048x72_cb/tsl18_memory_min.lib /users/iit/tower_memories/dpram256x18_cb/dpram256x18_cb_min.lib}
create_library_set -name Max -timing {/tools/kits/tower/PDK_TS18SL/CIO150_1_8v_Super_Compact_Inline_I_O_2007_07/synopsys/2002.05/models/tsl18cio150_max.lib /tools/kits/tower/PDK_TS18SL/FS120_STD_Cells_0_18um_2005_12/DW_TOWER_tsl18fs120/2005.12/synopsys/2004.12/models/tsl18fs120_max.lib /users/iit/tower_memories/spram2048x72_cb/spram2048x72_cb/tsl18_memory_max.lib /users/iit/tower_memories/dpram256x18_cb/dpram256x18_cb_max.lib}
create_constraint_mode -name TypCM -sdc_files {top.sdc} 
create_delay_corner -name SlowDC -library_set {Max}  -rc_corner {SlowRC}
create_delay_corner -name FastDC -library_set {Min}  -rc_corner {FastRC}
create_rc_corner -name FastRC -cap_table {/tools/kits/tower/PDK_TS18SL/iit/TSL_0.18_6M1L.CapTbl} -T {-40} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1} -postRoute_cap {1} -postRoute_xcap {1} -postRoute_clkres {0} -postRoute_clkcap {0} -qx_tech_file {/tools/kits/tower/PDK_TS18SL/iit/qrcTechFile}
create_analysis_view -name FastView -constraint_mode {TypCM} -delay_corner {FastDC}
create_analysis_view -name SlowView -constraint_mode {TypCM} -delay_corner {SlowDC}
set_analysis_view -setup {SlowView} -hold {FastView}


